///////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 												Author:  Skyer                       						 //
// 											Website: www.smartep.ru               							 //
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	#pragma once
//=============================================================================================================
	#define DS18B20_DDR				DDRD
	#define DS18B20_PIN				PIND
	#define DS18B20_PORT			PORTD
	#define DS18B20_DS				5
	#define DS18B20_REFRESH_TIME	5
	#define DS18B20_ERROR 			0xFFFF
	#define DS18B20_SEARCH_ROM 		0xF0		// Поиск адресов всех устройств по спецалгоритму
	#define DS18B20_READ_ROM 		0x33		// Считываение адреса единственного устройства
	#define DS18B20_MATCH_ROM 		0x55		// Активация конкретного устройства по его адресу
	#define DS18B20_SKIP_ROM 		0xCC 		// Обращение к единственному на шине устройству без указания его адреса
	#define DS18B20_ALARM_SEARCH 	0xEC		// Поиск устройств, у которых сработал ALARM (алгоритм поиска как у CMD_SERCH_ROM)
	#define DS18B20_CONVERT_T 		0x44		// Старт преобразования температуры
	#define DS18B20_W_SCRATCHPAD 	0x4E		// Запись во внутренний буфер (регистры)
	#define DS18B20_R_SCRATCHPAD 	0xBE		// Чтение внутреннего буфера (регистров)
	#define DS18B20_C_SCRATCHPAD 	0x48		// Сохранение регистров в EEPROM 
	#define DS18B20_RECALL_EE 		0xB8		// Заносит в буфер из EEPROM значение порога ALARM
	#define DS18B20_READ_POWER 		0xB4		// Определение, есть ли в шине устройства с паразитным питанием
	#define DS18B20_RES_9BIT 		0x1F		// Разрешение датчика (9 бит)
	#define DS18B20_RES_10BIT 		0x3F		// Разрешение датчика (10 бит)
	#define DS18B20_RES_11BIT 		0x5F		// Разрешение датчика (11 бит)
	#define DS18B20_RES_12BIT 		0x7F		// Разрешение датчика (12 бит)
//=============================================================================================================
	// запуск процесса измерения
	uint8_t DS18B20_Start();
	
	// чтение данных из DS18B20
	int DS18B20_Read();
